# Agregar y eliminar datos con Pandas

In [1]:
import pandas as pd

In [4]:
df_books = pd.read_csv('data/bestsellers.csv', sep=",", header=0)

In [7]:
df_books.head(2)

,Name,Author,User Rating,Reviews,Price,Year,Genre
0,10-Day Green Smoothie Cleanse,JJ Smith,4.7,17350,8,2016,Non Fiction
1,11/22/63: A Novel,Stephen King,4.6,2052,22,2011,Fiction

## Drop columns

In [16]:
# Borra la columna Year
df_books.drop('Year', axis=1).head(2)

,Name,Author,User Rating,Reviews,Price,Genre
0,10-Day Green Smoothie Cleanse,JJ Smith,4.7,17350,8,Non Fiction
1,11/22/63: A Novel,Stephen King,4.6,2052,22,Fiction

In [18]:
# Borra la columna Name
df_books.drop('Name', axis=1).head(2)

         Author  User Rating  Reviews  Price  Year        Genre
0      JJ Smith          4.7    17350      8  2016  Non Fiction
1  Stephen King          4.6     2052     22  2011      Fiction

## Drop rows

In [25]:
# Borra la fila 1
df_books.drop(1, axis=0).head(2)

,Name,Author,User Rating,Reviews,Price,Year,Genre
0,10-Day Green Smoothie Cleanse,JJ Smith,4.7,17350,8,2016,Non Fiction
2,12 Rules for Life: An Antidote to Chaos,Jordan B. Peterson,4.7,18979,15,2018,Non Fiction

In [27]:
# Borra las filas 1, 2 y 3
df_books.drop([1, 2, 3], axis=0).head(2)

,Name,Author,User Rating,Reviews,Price,Year,Genre
0,10-Day Green Smoothie Cleanse,JJ Smith,4.7,17350,8,2016,Non Fiction
4,"5,000 Awesome Facts (About Everything!) (Natio...",National Geographic Kids,4.8,7665,12,2019,Non Fiction

In [31]:
# Borra los primeros 10 registros
df_books.drop(range(10), axis=0).head(2)

,Name,Author,User Rating,Reviews,Price,Year,Genre
10,A Man Called Ove: A Novel,Fredrik Backman,4.6,23848,8,2017,Fiction
11,A Patriot's History of the United States: From...,Larry Schweikart,4.6,460,2,2010,Non Fiction

### Reto personal
- Borrar columnas por indice

In [99]:
# Seleccionamos solo las cabeceras
heads_drop = df_books.iloc[:0, 1:7:2]
print(heads_drop)
print(df_books.iloc[:0, :])

# Borramos las cabeceras sellecionadas en la variable heads_drop
df_books.drop(heads_drop, axis=1).head(2)

Empty DataFrame
Columns: [Author, Reviews, Year]
Index: []
Empty DataFrame
Columns: [Name, Author, User Rating, Reviews, Price, Year, Genre]
Index: []

                            Name  User Rating  Price        Genre
0  10-Day Green Smoothie Cleanse          4.7      8  Non Fiction
1              11/22/63: A Novel          4.6     22      Fiction